hebertreis/taptosow/esp8266-arduino/src/main.cpp
    // Configure MQTT client
    mqttClient.setClient(wifiClient);
    mqttClient.setServer(MQTT_HOST, MQTT_PORT);
    mqttClient.setCallback(mqttCallback);
    mqttClient.setBufferSize(1024);
    mqttClient.setKeepAlive(60);
    mqttClient.setSocketTimeout(30);
    
    Serial.print(F("[MQTT] Server: "));
    Serial.println(MQTT_HOST);
    Serial.print(F("[MQTT] Port: "));
    Serial.println(MQTT_PORT);
    Serial.print(F("[MQTT] Client ID: "));
    Serial.println(deviceId);
}

bool mqttConnect() {
    if (mqttClient.connected()) {
        return true;
    }
    
    Serial.print(F("[MQTT] Connecting..."));
    
    // Last will message
    String willTopic = mqttTopicBase + "/status";
    String willMessage = "{\"status\":\"offline\",\"timestamp\":" + String(millis()) + "}";
    
    if (mqttClient.connect(deviceId.c_str(), MQTT_USERNAME, MQTT_PASSWORD, 
                          willTopic.c_str(), 1, true, willMessage.c_str())) {
        Serial.println(F(" OK"));
        
        // Subscribe to command topic
        String commandTopic = mqttTopicBase + "/command";
        mqttClient.subscribe(commandTopic.c_str(), 1);
        Serial.print(F("[MQTT] Subscribed to: "));
        Serial.println(commandTopic);
        
        isMqttConnected = true;
        publishStatus();
        
        return true;
    } else {
        Serial.print(F(" FAILED - Code: "));
        Serial.println(mqttClient.state());
        isMqttConnected = false;
        return false;
    }
}

void mqttLoop() {
    mqttClient.loop();
    
    // Check connection
    if (!mqttClient.connected()) {
        if (millis() - lastReconnectAttempt > MQTT_RECONNECT_DELAY) {
            lastReconnectAttempt = millis();
            
            if (!mqttConnect()) {
                reconnectAttempts++;
                Serial.print(F("[MQTT] Reconnect attempt "));
                Serial.print(reconnectAttempts);
                Serial.println(F(" failed"));
                
                if (reconnectAttempts >= MAX_RECONNECT_ATTEMPTS) {
                    Serial.println(F("[MQTT] Max attempts reached"));
                    reconnectAttempts = 0;
                }
            }
        }
    }
    
    // Send heartbeat
    if (millis() - lastHeartbeat > HEARTBEAT_INTERVAL) {
        lastHeartbeat = millis();
        publishHeartbeat();
    }
}

void publishMessage(const String& topic, const String& payload, bool retained = false) {
    if (!isMqttConnected) {
        Serial.println(F("[MQTT] Cannot publish - not connected"));
        return;
    }
    
    if (mqttClient.publish(topic.c_str(), payload.c_str(), retained)) {
        Serial.print(F("[MQTT] Published to "));
        Serial.print(topic);
        Serial.print(F(": "));
        Serial.println(payload);
    } else {
        Serial.print(F("[MQTT] Publish failed to "));
        Serial.println(topic);
    }
}

void publishStatus() {
    StaticJsonDocument<256> doc;
    doc["status"] = isMqttConnected ? "online" : "offline";
    doc["state"] = currentState;
    doc["wifi_rssi"] = WiFi.RSSI();
    doc["free_heap"] = ESP.getFreeHeap();
    doc["timestamp"] = millis();
    doc["version"] = DEVICE_VERSION;
    doc["debugMode"] = debugMode;
    doc["readMode"] = readMode;
    doc["hasPendingCommand"] = pendingTenantId.length() > 0;

    String payload;
    serializeJson(doc, payload);

    publishMessage(mqttTopicBase + "/status", payload);
}

void publishHeartbeat() {
    StaticJsonDocument<256> doc;
    doc["type"] = "heartbeat";
    doc["deviceId"] = deviceId;
    doc["state"] = currentState;
    doc["wifi_rssi"] = WiFi.RSSI();
    doc["free_heap"] = ESP.getFreeHeap();
    doc["uptime"] = millis();
    doc["timestamp"] = millis();
    doc["debugMode"] = debugMode;
    doc["readMode"] = readMode;

    String payload;
    serializeJson(doc, payload);

    publishMessage(mqttTopicBase + "/heartbeat", payload);
}

void publishTagDetected(const String& tagId) {
    StaticJsonDocument<256> doc;
    doc["type"] = "tag_detected";
    doc["deviceId"] = deviceId;
    doc["tagId"] = tagId;
    doc["timestamp"] = millis();
    
    String payload;
    serializeJson(doc, payload);
    
    publishMessage(mqttTopicBase + "/result", payload);
}

void publishWriteResult(bool success, const String& error = "") {
    StaticJsonDocument<256> doc;
    doc["type"] = success ? "write_success" : "write_error";
    doc["deviceId"] = deviceId;
    doc["success"] = success;
    if (!success) {
        doc["error"] = error;
    }
    if (success && error.length() > 0) {
        doc["url"] = error; // Reuse error parameter for URL on success
        doc["error"] = "";
    }
    doc["timestamp"] = millis();

    String payload;
    serializeJson(doc, payload);

    publishMessage(mqttTopicBase + "/result", payload);
}

void publishDebugStatus() {
    StaticJsonDocument<256> doc;
    doc["type"] = "debug_status";
    doc["deviceId"] = deviceId;
    doc["debugEnabled"] = debugMode;
    doc["timestamp"] = millis();

    String payload;
    serializeJson(doc, payload);

    publishMessage(mqttTopicBase + "/debug", payload);
}

void publishReadModeStatus() {
    StaticJsonDocument<256> doc;
    doc["type"] = "read_mode_status";
    doc["deviceId"] = deviceId;
    doc["readModeEnabled"] = readMode;
    doc["timestamp"] = millis();

    String payload;
    serializeJson(doc, payload);

    publishMessage(mqttTopicBase + "/debug", payload);
}

void publishTagData(const String& tagId) {
    StaticJsonDocument<512> doc;
    doc["type"] = "tag_data";
    doc["deviceId"] = deviceId;
    doc["tagId"] = tagId;
    doc["timestamp"] = millis();
    
    // Add debug data if available
    if (debugMode) {
        MFRC522::MIFARE_Key key;
        for (byte i = 0; i < 6; i++) key.keyByte[i] = 0xFF;
        
        MFRC522::Uid uid;
        if (mfrc522.PICC_ReadCardSerial()) {
            uid = mfrc522.uid;
            
            String uidStr = "";
            for (byte i = 0; i < uid.size; i++) {
                if (uid.uidByte[i] < 0x10) uidStr += "0";
                uidStr += String(uid.uidByte[i], HEX);
                if (i < uid.size - 1) uidStr += ":";
            }
            doc["uid"] = uidStr;
            doc["uidLength"] = uid.size;
            doc["tagType"] = mfrc522.PICC_GetTypeName((MFRC522::PICC_Type)uid.sak);
            
            mfrc522.PICC_HaltA();
        }
        
        // Read NDEF data
        NfcTag tag = nfc.read();
        if (tag.hasNdefMessage()) {
            NdefMessage message = tag.getNdefMessage();
            doc["ndefRecordCount"] = message.getRecordCount();
            
