hebertreis/taptosow/esp8266-arduino/src/main.cpp
            JsonArray records = doc.createNestedArray("ndefRecords");
            for (int i = 0; i < message.getRecordCount(); i++) {
                NdefRecord record = message.getRecord(i);
                JsonObject recordObj = records.createNestedObject();
                
                String recordType = "";
                byte typeLen = record.getTypeLength();
                for (int j = 0; j < typeLen; j++) {
                    char c = record.getType()[j];
                    if (c >= 32 && c < 127) recordType += c;
                }
                recordObj["type"] = recordType;
                
                String payloadStr = "";
                uint16_t payloadLen = record.getPayloadLength();
                for (uint16_t j = 0; j < payloadLen; j++) {
                    char c = record.getPayload()[j];
                    if (c >= 32 && c < 127) payloadStr += c;
                }
                recordObj["payload"] = payloadStr;
            }
        }
    }

    String payload;
    serializeJson(doc, payload);

    publishMessage(mqttTopicBase + "/result", payload);
}

// ============================================================================
// NFC WRITER FUNCTIONS
// ============================================================================

String generateOneTapGoUrl(const String& tenantId, const String& sectorId) {
    // Generate URL based on tenant and sector
    // Format: https://onetapgo.site/a/{uniqueId}
    // The uniqueId should be generated and stored in Firestore
    
    // For now, use a combination of device ID and timestamp
    String uniqueId = deviceId + "_" + String(millis());
    return "https://onetapgo.site/a/" + uniqueId;
}

bool writeNfcTag(const String& tenantId, const String& sectorId, const String& url) {
    Serial.println(F("\n[NFC] Starting write process..."));
    displayShowState(STATE_WRITING);

    // Create NDEF message
    NdefMessage message = NdefMessage();

    // Add URI record (primary)
    message.addUriRecord(url.c_str());

    // Add text record (secondary info)
    String textRecord = "OneTapGo - Tenant: " + tenantId + " Sector: " + sectorId;
    message.addTextRecord(textRecord.c_str());

    if (debugMode) {
        Serial.println(F("[NFC] === NFC Write Debug ==="));
        Serial.print(F("[NFC] URL to write: "));
        Serial.println(url);
        Serial.print(F("[NFC] Text record: "));
        Serial.println(textRecord);
        
        // Debug NDEF message size
        int messageSize = message.getEncodedSize();
        Serial.print(F("[NFC] Encoded message size: "));
        Serial.println(messageSize);
    }

    // Write to tag
    bool success = nfc.write(message);

    if (success) {
        Serial.println(F("[NFC] Write successful"));
        displayShowState(STATE_SUCCESS);
        publishWriteResult(true, url);

        // Store tag data in Firestore via HTTPS call (optional)
        // storeTagInFirestore(tenantId, sectorId, url);

        return true;
    } else {
        Serial.println(F("[NFC] Write failed"));
        displayShowState(STATE_ERROR, "Write failed");
        publishWriteResult(false, "NFC write error");
        return false;
    }
}

void processNfcTag() {
    Serial.println(F("\n[NFC] Tag detected!"));
    currentState = STATE_TAG_DETECTED;
    displayShowState(STATE_TAG_DETECTED);

    // Read tag data for debug
    String tagId = readTagData();

    // Publish tag detection
    publishTagDetected(tagId);

    // Check if in read mode
    if (readMode || currentState == STATE_READ_MODE) {
        Serial.println(F("[NFC] Read mode - sending tag data"));
        publishTagData(tagId);
        
        // Wait for tag removal
        waitForTagRemoval();
        
        // Return to read mode or idle
        currentState = readMode ? STATE_READ_MODE : STATE_IDLE;
        displayShowState(currentState);
        return;
    }

    // Check if we have pending write command
    if (pendingTenantId.length() > 0 && pendingSectorId.length() > 0 && pendingUrl.length() > 0) {
        // Wait for user to position tag correctly
        displayShowMessage("Processing", "Keep tag steady...", 500);

        // Attempt write
        bool success = writeNfcTag(pendingTenantId, pendingSectorId, pendingUrl);

        // Clear pending command
        pendingTenantId = "";
        pendingSectorId = "";
        pendingUrl = "";

        if (success) {
            currentState = STATE_SUCCESS;
        } else {
            currentState = STATE_ERROR;
        }

        // Wait for tag removal
        Serial.println(F("[NFC] Waiting for tag removal..."));
        displayShowMessage("Complete", "Remove tag now", 0);

        unsigned long waitStart = millis();
        while (nfc.tagPresent() && (millis() - waitStart < 10000)) {
            yield();
            delay(100);
        }

        // Reset to idle
        currentState = STATE_IDLE;
        displayShowState(STATE_IDLE);

    } else {
        // No pending command, just read tag info
        Serial.println(F("[NFC] No pending write command"));
        displayShowMessage("Info", "No write pending", 2000);
        currentState = STATE_IDLE;
    }

    mfrc522.PICC_HaltA();
    mfrc522.PCD_StopCrypto1();
    SPI.endTransaction();  // Fecha SPI para evitar conflitos com o display
}

String readTagData() {
    String tagId = "tag_" + String(millis());
    
    if (debugMode) {
        Serial.println(F("[NFC] === Tag Read Debug ==="));
        
        // Read UID
        MFRC522::MIFARE_Key key;
        for (byte i = 0; i < 6; i++) key.keyByte[i] = 0xFF;
        
        MFRC522::Uid uid;
        if (mfrc522.PICC_ReadCardSerial()) {
            uid = mfrc522.uid;
            
            Serial.print(F("[NFC] Tag UID: "));
            for (byte i = 0; i < uid.size; i++) {
                if (uid.uidByte[i] < 0x10) Serial.print(F("0"));
                Serial.print(uid.uidByte[i], HEX);
                Serial.print(F(" "));
            }
            Serial.println();
            
