hebertreis/taptosow/esp8266-arduino/src/main.cpp
            Serial.print(F("[NFC] UID length: "));
            Serial.println(uid.size);
            
            Serial.print(F("[NFC] Tag type: "));
            Serial.println(mfrc522.PICC_GetTypeName((MFRC522::PICC_Type)uid.sak));
            
            mfrc522.PICC_HaltA();
        }
        
        // Try to read NDEF data
        Serial.println(F("[NFC] Attempting to read NDEF data..."));
        NfcTag tag = nfc.read();
        if (tag.hasNdefMessage()) {
            NdefMessage message = tag.getNdefMessage();
            Serial.print(F("[NFC] NDEF records: "));
            Serial.println(message.getRecordCount());
            
            for (int i = 0; i < message.getRecordCount(); i++) {
                NdefRecord record = message.getRecord(i);
                Serial.print(F("[NFC] Record "));
                Serial.print(i);
                Serial.print(F(" Type: "));
                
                // Print type as hex bytes
                byte typeLen = record.getTypeLength();
                for (byte j = 0; j < typeLen; j++) {
                    byte b = record.getType()[j];
                    if (b < 0x10) Serial.print(F("0"));
                    Serial.print(b, HEX);
                    Serial.print(F(" "));
                }
                Serial.println();
                
                String payload = "";
                uint16_t payloadLen = record.getPayloadLength();
                for (uint16_t j = 0; j < payloadLen; j++) {
                    char c = record.getPayload()[j];
                    if (c >= 32 && c < 127) payload += c;
                }
                Serial.print(F("[NFC] Payload: "));
                Serial.println(payload);
            }
        } else {
            Serial.println(F("[NFC] No NDEF data or read failed"));
        }
        
        Serial.println(F("[NFC] ========================"));
    }
    
    return tagId;
}

void waitForTagRemoval() {
    Serial.println(F("[NFC] Waiting for tag removal..."));
    displayShowMessage("Complete", "Remove tag now", 0);
    
    unsigned long waitStart = millis();
    while (nfc.tagPresent() && (millis() - waitStart < 10000)) {
        yield();
        delay(100);
    }
}

void nfcInit() {
    Serial.println(F("\n[NFC] Initializing RC522..."));
    
    SPI.begin();
    mfrc522.PCD_Init();
    
    // Set maximum antenna gain
    mfrc522.PCD_SetAntennaGain(mfrc522.RxGain_max);
    
    // Wait for RC522 to be ready
    delay(100);
    
    // Check firmware version
    byte version = mfrc522.PCD_ReadRegister(mfrc522.VersionReg);
    Serial.print(F("[NFC] RC522 Firmware Version: 0x"));
    Serial.println(version, HEX);
    
    if (version == 0x00 || version == 0xFF) {
        Serial.println(F("[NFC] WARNING: RC522 not found or not responding!"));
        displayShowMessage("NFC Error", "RC522 not found", 3000);
    } else {
        Serial.println(F("[NFC] RC522 initialized successfully"));
        displayShowMessage("NFC OK", "Ready to write", 1000);
    }
}

// ============================================================================
// SYSTEM FUNCTIONS
// ============================================================================

void systemInit() {
    // Initialize serial
    Serial.begin(115200);
    delay(1000);
    
    Serial.println(F("\n========================================"));
    Serial.println(F("   ONETAPGO NFC WRITER v" DEVICE_VERSION));
    Serial.println(F("        BY CRE8 TECNOLOGIA"));
    Serial.println(F("========================================"));
    Serial.print(F("[SYS] Free heap: "));
    Serial.println(ESP.getFreeHeap());
    Serial.print(F("[SYS] Chip ID: "));
    Serial.println(ESP.getChipId());
    
    // Initialize display
    displayInit();
    displayShowState(STATE_CONFIG_MODE);
    
    // Initialize WiFi
    wifiInit();
    displayShowState(STATE_IDLE);
    
    // Initialize MQTT
    mqttInit();
    
    // Initialize NFC
    nfcInit();
    
    // Configure button pin (optional)
    pinMode(BUTTON_PIN, INPUT_PULLUP);
    
    Serial.println(F("\n[SYS] Initialization complete"));
    Serial.print(F("[SYS] Free heap after init: "));
    Serial.println(ESP.getFreeHeap());
}

void systemLoop() {
    // Check WiFi connection
    wifiCheckConnection();

    // Handle MQTT
    mqttLoop();

    // Check for NFC tag (when waiting, idle, or in read mode)
    if (currentState == STATE_WAITING_TAG || currentState == STATE_IDLE || currentState == STATE_READ_MODE) {
        if (nfc.tagPresent()) {
            processNfcTag();
        }
    }

    // Check button (optional manual trigger)
    static unsigned long lastButtonCheck = 0;
    if (millis() - lastButtonCheck > 100) {
        lastButtonCheck = millis();
        if (digitalRead(BUTTON_PIN) == LOW) {
            delay(50); // Debounce
            if (digitalRead(BUTTON_PIN) == LOW) {
                Serial.println(F("[BTN] Button pressed"));
                // Could trigger manual write or other action
            }
        }
    }

    // Watchdog feed
    yield();
}

// ============================================================================
// ARDUINO SETUP & LOOP
// ============================================================================

void setup() {
    systemInit();
    displayShowState(STATE_IDLE);
}

void loop() {
    systemLoop();
}
